{
	"query": "web3",
	"articles": [
		{
			"title": "Web3.0 на Python, часть 1: основы",
			"datetime": "2022-09-02T11:55:56.000Z",
			"author": "shamaevnn",
			"description": "Привет, Хабр! Во время знакомства с Web3 было сложно найти понятные примеры базовых операций с блокчейном с использованием Web3Py в одном месте. Например: просмотр баланса, отправка ETH и ERC20 токенов, минтинг NFT, взаимодействие с контрактами и тд. Эта статья как раз и послужит таким местом. Анонс второй части с advanced примерами, которые больше подойдут для использования в продакшене с оптимизацией запросов и тд, будет в телеграм канале. ",
			"tags": [
				"python",
				"web3",
				"криптовалюта",
				"примеры",
				"nft",
				"токены",
				"api",
				"crypto",
				"howtodefi",
				"erc20"
			],
			"link": "https://habr.com/ru/post/674204/"
		},
		{
			"title": "Выполнение публичных и приватных транзакций в блокчейне JPMorgan Quorum с использованием Web3",
			"datetime": "2019-06-18T07:43:13.000Z",
			"author": "allexx",
			"description": " \n\nQuorum — блокчейн на базе Ethereum, разработанный JPMorgan и совсем недавно ставший первой платформой распределенного реестра, которую предлагает Microsoft Azure.\nQuorum поддерживает приватные и публичные транзакции и имеет много коммерческих сценариев использования.\nВ данной статье мы разберем один из таких сценариев — развертывание сети распределенного реестра между супермаркетом и владельцем склада для обеспечения актуальной информации о температуре складского помещения.\nКод, используемый в данном руководстве, лежит в репозитории на GitHub.\nСтатья покрывает:\n\nсоздание смарт-контракта;\nразвертывание сети Quorum при помощи Chainstack;\nпубличные транзакции Quorum;\nприватные транзакции Quorum.\n\nДля иллюстрации используется сценарий мониторинга температуры в складских помещениях участников сети Quorum в рамках Internet of Things (IoT).",
			"tags": [
				"quorum",
				"blockchain",
				"ethereum",
				"web3.js",
				"chainstack",
				"javascript",
				"decentralization",
				"tutorial",
				"cryptography",
				"smartcontract"
			],
			"link": "https://habr.com/ru/post/456368/"
		},
		{
			"title": "Основатель Signal: «Первые впечатления от web3»",
			"datetime": "2022-01-09T18:23:19.000Z",
			"author": "novusnota",
			"description": "Несмотря на то, что я считаю себя криптографом, меня не особенно привлекает слово \"крипто\". Не думаю, что я уже староват, но я гораздо чаще кликаю на мемы в духе \"Интернет всё помнит\" о том, как \"крипто\" раньше означало \"криптография\", чем на последние новости об NFT.Но учитывая всё то внимание, которое в последнее время уделяется тому, что сейчас называют web3, я решил более тщательно изучить всё происходящее в этой сфере, чтобы точно ничего не упустить...",
			"tags": [
				"nft",
				"распределённые системы",
				"информационная безопасность",
				"блокчейн",
				"ethereum",
				"web3",
				"web2",
				"web1",
				"криптовалюты",
				"blockchain"
			],
			"link": "https://habr.com/ru/post/599771/"
		},
		{
			"title": "Кофе с токенами, пожалуйста: Starbucks запускает Web3-сообщество",
			"datetime": "2022-09-13T10:02:45.000Z",
			"author": "Markaty",
			"description": "Starbucks представила платформу лояльности Starbucks Odyssey «с блокчейном и NFT». Задача новой платформы — превратить «ещё одну клиентскую программу» в Web3-сообщество. Понимая, что выход в Web3 может быть воспринят как очередная маркетинговая уловка, популярная сеть кофеен сразу заявила, что у неё всё по-другому и всерьёз.",
			"tags": [
				"starbucks",
				"nft",
				"web3"
			],
			"link": "https://habr.com/ru/post/687976/"
		},
		{
			"title": "Что такое Web3? Децентрализованный Интернет будущего",
			"datetime": "2022-02-11T19:51:38.000Z",
			"author": "AlexeyFront",
			"description": "Если вы читаете эту статью, значит, вы являетесь участником современного Интернета. Интернет, с которым мы сталкиваемся сегодня, значительно отличается от того, каким он был всего 10 лет назад. Как развивался веб, и, что более важно, куда он движется дальше? И почему все это очень важно?Если история нас чему-то научила, то эти изменения будут иметь большое значение в будущем.В этой статье я расскажу о том, как развивался интернет, куда он движется дальше и почему это важно понимать.Подумайте о том, как интернет влияет на вашу жизнь каждый день. Подумайте, как изменилось общество благодаря интернету. Платформы социальных сетей. Мобильные приложения. И сейчас интернет переживает очередную смену парадигмы.",
			"tags": [
				"default.png",
				"web3",
				"tokenization"
			],
			"link": "https://habr.com/ru/post/651077/"
		},
		{
			"title": "Web3 и NFT: хайп обоснован или нет? Ещё неясно",
			"datetime": "2022-01-15T22:59:33.000Z",
			"author": "kalupin",
			"description": "Основатель Signal написал на прошлой неделе сильный текст о проблемах web3 и, в частности, NFT. Привожу краткое саммари статьи + дискуссии о перспективах самой модной (по ожиданиям венчурных капиталистов) темы 2022 года. Высказались в том числе фаундер Metamask и создатель Ethereum.И зову вместе разбираться, обоснован ли хайп. ",
			"tags": [
				"web3",
				"NFT",
				"блокчейн",
				"ethereum",
				"криптовалюты",
				"распределенные системы",
				"шифрование",
				"blockchain",
				"metamask",
				"хайп"
			],
			"link": "https://habr.com/ru/post/645807/"
		},
		{
			"title": "За последние полгода хакеры и мошенники украли из проектов Web3 больше, чем за весь 2021 год",
			"datetime": "2022-07-11T16:25:21.000Z",
			"author": "ancotir",
			"description": "Хакерам и мошенникам за последние полгода удалось украсть из проектов Web3 больше, чем за весь 2021 год, сообщает TechRadar со ссылкой на отчёт CertiK. Сумма украденных за полгода средств составила $2 млрд. Социальная инженерия всё ещё остаётся излюбленным инструментом мошенников, однако в последнее время всё большую популярность приобретают атаки с использованием Flash Loan или флэш-кредитов (взять средства в долг, купить цифровые монеты, продать, вернуть средства).",
			"tags": [
				"web3",
				"криптовалюты",
				"мошенничество",
				"хакеры",
				"CertiK"
			],
			"link": "https://habr.com/ru/post/676354/"
		},
		{
			"title": "Борьба с централизацией Интернета. За что ругают модный Web3?",
			"datetime": "2022-01-13T09:00:02.000Z",
			"author": "oldadmin",
			"description": "Иллюстрация из статьи «О распределённых сетях связи» (1964), её автор Пол Бэран изобрёл коммутацию пакетов и помог спроектировать «сеть, способную устоять в ядерной войне»\n\r\nИнтернет по своей сути — проект ЦРУ символ децентрализации. Большинство интернет-технологий работают по открытой и распределённой модели. Электронная почта, WWW, торренты, wiki, git-репозитории, Tor, биткоин и многое другое.\n\r\nДецентрализация — синоним эффективности, живучести, устойчивости к цензуре, попыткам блокировки. Это базовый принцип, от которого нельзя отступать.",
			"tags": [
				"ruvds_статьи",
				"Веб 3.0",
				"Web3",
				"шифропанк",
				"пирамида",
				"МММ",
				"Bitcoin",
				"децентрализованные сети",
				"DeFi",
				"крипта",
				"вознаграждение за честность",
				"Ethereum Mainnet",
				"электронная почта",
				"криптоанархия",
				"сетевые эффекты",
				"федеративные протоколы",
				"SMTP",
				"XMPP",
				"шифрование"
			],
			"link": "https://habr.com/ru/post/599957/"
		},
		{
			"title": "Как я поверил в web3",
			"datetime": "2022-06-12T17:09:39.000Z",
			"author": "urvalla",
			"description": "Я занимаюсь разработкой и управлением разработкой уже около 15 лет. И могу вполне ехать по этим рельсам дальше. Но внутренний запрос на изучение новых технологий повёл меня за собой. Вёл плавно, год за годом, и вот довёл до этой точки - я стартаплю в web3. В статье я не буду рассказывать про свой проект, я расскажу о том как дошёл до жизни такой, и главное - почему я поверил в web3.",
			"tags": [
				"web3",
				"decentralization",
				"venture capital",
				"развитие",
				"стартапы"
			],
			"link": "https://habr.com/ru/post/671032/"
		},
		{
			"title": "Об оракулах для блокчейнов и немного о Web3",
			"datetime": "2020-07-31T21:24:27.000Z",
			"author": "IvaA",
			"description": "В данный момент блокчейны сильно изолированны от внешних источников информации — как централизованных ресурсов, так и других блокчейнов. Чтобы разные цепочки блоков были совместимы и легко обменивались данными между собой (и с внешними ресурсами) можно использовать оракулов. \n\n",
			"tags": [
				"блокчейн",
				"оракулы",
				"oracles",
				"web3"
			],
			"link": "https://habr.com/ru/post/513000/"
		},
		{
			"title": "Школьный портал и Web3.0.",
			"datetime": "2008-10-13T21:06:19.000Z",
			"author": "cloud",
			"description": "Тема школьного портала уже навязла на зубах, однако стоит в эту серию пятиминуток ненависти внести некоторое рациональное зерно.\n\r\nНачнем с того, что такое явление как школьный портал не нужно в принципе.\n",
			"tags": [
				"web3.0",
				"школьный портал",
				"образование",
				"образование 2.0"
			],
			"link": "https://habr.com/ru/post/42229/"
		},
		{
			"title": "web3 не будет: расходимся по домам",
			"datetime": "2022-06-28T11:17:31.000Z",
			"author": "lisa_minaeva",
			"description": "Я тут набрела на январскую статью основателя Signal app [мессенджер, конфиденциально безопасно оупенсорс].Если коротко, смысл статьи следующий: ребят, ну хватит писать кипятком от вашего веб3 — это же сказки.Чтобы нас с вами вразумить, Moxie сделал два dApp (ну все конечно было не совсем так: нет Мокси до нас никакого дела, он это сделал по приколу).",
			"tags": [
				"блокчейн",
				"крипта",
				"nft",
				"токен",
				"децентрализация",
				"web3",
				"криптовалюта",
				"ethereum"
			],
			"link": "https://habr.com/ru/post/673836/"
		},
		{
			"title": "cyberd: Computing the knowledge from web3",
			"datetime": "2019-01-27T01:57:56.000Z",
			"author": "starodubcev",
			"description": "The original post has been updated based on community input in order to remove confusion.\nFinal version of the whitepaper is available here:\nhttps://github.com/cybercongress/cyber/releases",
			"tags": [
				"web3",
				"go",
				"ethereum",
				"cosmos-sdk",
				"blockchains",
				"ipfs"
			],
			"link": "https://habr.com/ru/post/437672/"
		},
		{
			"title": "Погружение в разработку на Ethereum. Часть 2: Web3.js и газ",
			"datetime": "2017-08-30T12:32:29.000Z",
			"author": "rubyruby",
			"description": "В предыдущей статье мы описали деплой контрактов и взаимодействие с ними через пользовательский интерфейс кошелька Mist, но это не подходит для реальной разработки. Нужна библиотека, которая позволит работать с блокчейном из кода пользовательского приложения. В этой статье мы кратко рассмотрим что представляет собой библиотека Web3.js, пощупав ее из консоли Geth. И еще одна важная тема, которая наверняка интересует не только разработчиков, но и потенциальных заказчиков — сколько стоят транзакции на блокчейне, ведь каждая из них требует газа, который покупается за эфир.\n\n",
			"tags": [
				"ethereum",
				"смарт-контракты",
				"solidity",
				"gas",
				"блокчейн"
			],
			"link": "https://habr.com/ru/post/336770/"
		},
		{
			"title": "Создание реального приложения dApp с помощью React, Solidity и Web3.js",
			"datetime": "2022-02-27T18:42:06.000Z",
			"author": "AlexeyFront",
			"description": "Добрый день, читатели Хабра, представляю перевод статьи по разработке dApp. Приятного чтения.Мир онлайн-технологий быстро переходит к веб 3.0 (перевод этой статьи можете найти здесь). Похоже, что люди устали от централизованных систем, где их цифровая конфиденциальность ежедневно нарушается огромными организациями. Также хочется найти решение этой проблемы, и веб 3.0, похоже, на данный момент является ответом.Эта статья в блоге не предназначена для освещения ноу-хау блокчейна и децентрализованных систем. Вместо этого он предназначен для тех, кто хотел бы создать онлайн-решения для пользователей, клиентов и покупателей, чтобы гарантировать им лучшую конфиденциальность и безопасность их данных.Прояснив это, в данной статье я собираюсь показать вам азбуку того, как создать децентрализованное приложение с нуля и настроить среду разработки. Ниже перечислены некоторые темы, которые мы рассмотрим.",
			"tags": [
				"децентрализованные технологии",
				"ethereum",
				"react.js",
				"solidity",
				"web 3.0"
			],
			"link": "https://habr.com/ru/post/653679/"
		},
		{
			"title": "Взлетит или нет — две разные точки зрения на Web3",
			"datetime": "2022-06-11T19:23:39.000Z",
			"author": "VASExperts",
			"description": "Последнее время очень много говорят о Web3 — в тематических СМИ и на профильных площадках, в том числе на Хабре. Концепция подразумевает, разработку приложений, которые работают либо на блокчейне, либо в децентрализованных одноранговых сетях. Мы не будем погружаться в особенности реализации таких решений, но обсудим мнения по этому вопросу. Профессиональное сообщество разделилось на два лагеря. Кто-то видит в Web3 будущее, а кто-то — считает утопией, пузырем и призывает сразу смотреть в сторону Web4.",
			"tags": [
				"vas experts",
				"web 3.0",
				"web 4.0",
				"децентрализованные сети",
				"разработка систем связи"
			],
			"link": "https://habr.com/ru/post/670964/"
		},
		{
			"title": "Размышления на тему web3.0",
			"datetime": "2007-05-23T22:51:37.000Z",
			"author": "mikedin",
			"description": "В интернете есть куча статей на тему того, что будет представлять из себя web3. Поробую и я взглянуть на эту тему под своим углом.\n\r\nЗа основу для размышлений взяты следующие документы\nlirik.habrahabr.ru/blog/11651.html\nsethgodin.typepad.com/seths_blog/2007/01/web4.html\n\r\nИз них (почитайте, это интересно) получается, что по Годину web4 будет составлен из трех составляющих Ubiquity, Identity, Connection. Карр лишь ругает web2 за дилетанство и ничего не предлагает. Так как же будет устроен новый веб?..\n",
			"tags": [
				"Веб 2.0",
				"Веб 3.0",
				"социальные сети"
			],
			"link": "https://habr.com/ru/post/8798/"
		},
		{
			"title": "Как развернуть свою блокчейн-платформу на базе технологий Web3 Tech",
			"datetime": "2022-09-27T09:46:19.000Z",
			"author": "klauss_z",
			"description": "В апреле этого года, после нескольких лет успешного развития платформы Waves Enterprise и ее использования в различных проектах мы решили выпустить её open-source версию, чтобы расширить охват потенциальных пользователей платформы. Мы сохранили в ней почти всю функциональность и классные фичи: это контейнеризированные смарт-контракты на любом языке, поддержка трех разных консенсусов, возможность обмена конфиденциальными данными и не только. Убрали только поддержку ГОСТ-криптографии, TLS и PKI.В этом посте мы сравним наш блокчейн с известными аналогами, расскажем, как развернуть его самостоятельно и настроить мониторинг. В итоге вы получите готовую блокчейн-песочницу для экспериментов и разработки децентрализованных приложений на любом языке программирования.",
			"tags": [
				"блокчейн",
				"блокчейн-платформа",
				"блокчейн-проект"
			],
			"link": "https://habr.com/ru/post/690364/"
		},
		{
			"title": "Microsoft считает, что внедрение web3 может принести с собой новые формы фишинга",
			"datetime": "2022-02-21T10:42:00.000Z",
			"author": "daniilshat",
			"description": "Специалисты из Microsoft 365 Defender сообщили, что концепцию web3 нельзя назвать полностью безопасной и она также подвержена различного рода атакам. В частности, мошенники могут активно применять фишинг и воровать цифровые активы с криптокошельков пользователей.",
			"tags": [
				"microsoft",
				"криптовалюты",
				"информационная безопасность",
				"фишинг"
			],
			"link": "https://habr.com/ru/post/652701/"
		},
		{
			"title": "Лёгкий «Frontend» на Golang для ручного тестирования Ethereum смарт контракта без JavaScript и Web3",
			"datetime": "2018-01-11T08:29:36.000Z",
			"author": "dzeck",
			"description": "Привет!\nУ меня возникла идея разработать надеюсь простое решение, для ручного тестирования смарт контрактов Ethereum. Стало интересно сделать, что-то похожее на функционал вкладки Run в Remix.",
			"tags": [
				"golang",
				"ethereum"
			],
			"link": "https://habr.com/ru/post/346432/"
		},
		{
			"title": "Погружение в разработку на Ethereum. Часть 3: приложение для пользователя",
			"datetime": "2017-10-03T05:16:53.000Z",
			"author": "rubyruby",
			"description": "В предыдущих статьях (часть 1 и часть 2) мы описали как можно пользоваться децентрализованными приложениями на смарт-контрактах, если вы сами не против быть нодом. Но чем меньше пользователя заставляют совершать дополнительные действия — тем лучше. Для работы со смарт контрактами необходимо подписывать транзакции приватным ключом, поэтому совсем без дополнительный действий, к сожалению, не обойтись. В этой статье мы рассмотрим два подхода: первый — полноценное децентрализованное приложение (DApp) на javascript с использованием библиотеки Web3 и плагина MetaMask, второй — аналогичное приложение, но использующее Ruby on Rails API и гем Ethereum.rb для доступа к блокчейну.\n\n",
			"tags": [
				"блокчейн",
				"ethereum",
				"solidity",
				"javascript",
				"web3",
				"ruby on rails"
			],
			"link": "https://habr.com/ru/post/339080/"
		},
		{
			"title": "Эксперименты с контрактами Solidity в тестовой сети Rinkeby блокчейна Ethereum",
			"datetime": "2017-12-14T14:07:18.000Z",
			"author": "AlexandreFrolov",
			"description": "\n\r\nЭта статья представляет собой небольшое практическое руководство, которое поможет вам быстро настроить среду разработки смарт-контрактов на языке Solidity для блокчейна Ethereum. Вы опубликуете первый контракт, сохраните его в тестовом блокчейне Rinkeby и научитесь вызывать методы контракта. Это будет ваш первый шаг на пути создания децентрализованных приложений DApp (Decentralized Application).\n\r\nНесмотря на обилие книг, статей и руководств, посвященной теме этой статьи, новичку довольно трудно приступить к публикации контрактов и работе с ними. При попытке что-то сделать по книгам, руководствам и статьям нередко оказывается, что примеры не работают, а команды возвращают непонятные ошибки. Я попытаюсь в некоторой степени упростить первый этап освоения, отразив в этой статье свой опыт изучения Ethereum.\n\r\nПри погружении в эту тему я использовал приложение (браузер) Mist в среде Microsoft Windows, а также интерфейс командной строки Geth узла Ethereum в среде Ubuntu. В этой статье мы расскажем о работе с Geth, а также немного о том, как вызывать методы контрактов из Node.js.\n\r\nС благодарностью приму замечания и пожелания по дальнейшим статьям про блокчейн Ethereum, разработку контрактов на языке Solidity и приложений DApp.",
			"tags": [
				"Solidity",
				"Ethereum",
				"geth",
				"DApp",
				"web3.js",
				"Rinkeby",
				"блокчейн",
				"криптовалюта",
				"смарт-контракт"
			],
			"link": "https://habr.com/ru/post/344578/"
		},
		{
			"title": "Dive into Ethereum",
			"datetime": "2017-04-28T10:30:43.000Z",
			"author": "Pavlov_dog",
			"description": "Сегодня платформа Ethereum стала одним из самых узнаваемых брендов блокчейн сферы, вплотную приблизившись по популярности (и капитализации) к Bitcoin. Но из-за отсутствия \"полноценного\" рускоязычного гайда, отечественные разработчики все еще не очень понимают, что это за зверь и как с ним работать. Поэтому в данной статье я попытался максимально подробно охватить все аспекты разработки умных контрактов под Ethereum.\nЯ расскажу про инструменты разработки, сам ЯП, процесс добавления UI и еще много интересного. В конечном итоге мы получим обычный сайт-визитку, но \"под капотом\" он будет работать на умных контрактах Ethereum. Кого заинтересовало — прошу под кат.\n",
			"tags": [
				"blockchain",
				"ethereum",
				"smart contracts",
				"solidity",
				"metamask",
				"web3"
			],
			"link": "https://habr.com/ru/post/327236/"
		},
		{
			"title": "Opera запускает Crypto Browser для iOS",
			"datetime": "2022-04-14T18:14:09.000Z",
			"author": "AnnieBronson",
			"description": "Opera запустила версию своего браузера, ориентированного на криптовалюту, для iOS. Версии Crypto Browser для Windows, Mac и Android доступны с января.",
			"tags": [
				"opera",
				"opera crypto browser",
				"web3",
				"криптовалюты",
				"dapp",
				"децентрализованные приложения",
				"ios"
			],
			"link": "https://habr.com/ru/post/661065/"
		},
		{
			"title": "Взаимодействие веб-страницы с Ethereum",
			"datetime": "2017-12-08T19:41:35.000Z",
			"author": "dnagor",
			"description": "В сети появилось довольно много материалов про разработку для блокчейн Ethereum и про смарт-контракты, а так же про то, как создавать эти самые смарт-контракты. \n\r\nВ конце концов, есть официальная документация и stackoverflow. \n\r\nВ то же время, долго разбираться в документации не хочется, и многие разработчики в последнее время хотят побыстрее что-то пощупать руками и написать что-нибудь под эфириум, а так как вопросов возникает масса и источники разрознены, я решил собрать в одном месте простой пошаговый мануал с картинками по созданию своего первого dapp (от decentralized app) — децентрализованного приложения. Он будет представлять из себя связку смарт-контракта с веб-интерфейсом. То есть чтобы с помощью веба можно было доставать информацию из блокчейна и пихать ее туда. Постараюсь быть кратким, шаги буду объяснять по ходу дела.",
			"tags": [
				"solidity",
				"blockchain",
				"ethereum",
				"web3.js",
				"javascript"
			],
			"link": "https://habr.com/ru/post/344270/"
		},
		{
			"title": "Платёжная система в 50 строк кода, реально?",
			"datetime": "2018-02-13T16:46:25.000Z",
			"author": "zhek",
			"description": "В последнее время технологические решения на блокчейне всё больше проникают в нашу повседневную жизнь. Технология новая, поэтому не все понимают, как и где её применять. Я попробовал создать платежную систему на базе смарт-контракта Ethereum и результат меня удивил. Смарт-контракт выполняющий функции полноценной платёжной системы получился всего в 50 строк кода. Всех заинтересовавшихся как он работает прошу под кат.\n\n",
			"tags": [
				"solidity",
				"blockchain",
				"ethereum",
				"web3.js",
				"javascript",
				"smart contracts",
				"metamask"
			],
			"link": "https://habr.com/ru/post/348876/"
		},
		{
			"title": "Книга «Создание смарт-контрактов Solidity для блокчейна Ethereum. Практическое руководство»",
			"datetime": "2019-10-15T11:30:30.000Z",
			"author": "AlexandreFrolov",
			"description": "\r\nБольше года я работал над книгой «Создание смарт-контрактов Solidity для блокчейна Ethereum. Практическое руководство», и вот теперь эта работа завершена, а книга издана и доступна в Литресе.\n\r\nНадеюсь, моя книга поможет быстро приступить к созданию смарт-контактов Solidity и распределенных приложений DApp для блокчейна Ethereum. Она состоит из 12 уроков с практическими заданиями. Выполнив их, читатель сможет создавать собственные локальные узлы Ethereum, публиковать смарт-контракты и вызывать их методы, обмениваться данными между реальным миром и смарт-контрактами с помощью оракулов, работать с тестовой отладочной сетью Rinkeby. \n\r\nКнига адресована всем, кто интересуется передовыми технологиями в области блокчейнов и хочет быстро получить знания, позволяющие заниматься интересной и перспективной работой.\n\r\nНиже вы найдете оглавление и первую главу книги (также на Литресе доступны фрагменты книги). Надеюсь получить обратную связь, замечания и предложения. Все это я постараюсь учесть при подготовке следующей редакции книги.",
			"tags": [
				"Solidity",
				"Ethereum",
				"geth",
				"DApp",
				"web3.js",
				"Rinkeby",
				"блокчейн",
				"криптовалюта",
				"смарт-контракт"
			],
			"link": "https://habr.com/ru/post/467347/"
		},
		{
			"title": "Eppie: чего не хватает новому интернету?",
			"datetime": "2022-08-27T07:00:02.000Z",
			"author": "BaJlepa",
			"description": "Привет, Хабр! Давайте знакомиться. Это Eppie — децентрализованный сервис обмена зашифрованными сообщениями. Проект еще в разработке, но представиться профессиональному сообществу уже пора.Eppie будет работать в одноранговой p2p сети. Приложение шифрует сообщения по стандарту PGP, разбивает на фрагменты и рассылает их случайным нодам на хранение. В таком «перепутанном» виде данные остаются в сети. У Eppie нет почтовых серверов, все устройства участвуют в работе системы на равных. А в учетной записи пользователя нет ничего, кроме публичного ключа — он же адрес в сети. Приватный ключ дает доступ к содержанию переписки. Взломать такую систему практически невозможно. И поскольку никто не может прочитать чужие сообщения и метаданные, в Eppie невозможна цензура и использование персональных данных для рекламного таргетинга.  Это наша первая публикация, и в ней мы хотим рассказать, почему считаем, что интернету следующего поколения не обойтись без собственного почтового протокола. ",
			"tags": [
				"p2p",
				"web3",
				"email",
				"messenger",
				"e2e",
				"cryptography"
			],
			"link": "https://habr.com/ru/post/679196/"
		},
		{
			"title": "Интернет будущего. Где мы сейчас и за что критикуют web 3.0?",
			"datetime": "2022-07-08T10:35:41.000Z",
			"author": "itsalivestudio",
			"description": "Мы живем в эпоху интернета web 2.0. Однако не за горами следующая версия всемирной паутины – децентрализованный web 3.0. Или это утопия? Зачем он нужен? Что не так с современным цифровым миром? Давайте разбираться.",
			"tags": [
				"web3",
				"blockchain",
				"децентрализация",
				"интернет"
			],
			"link": "https://habr.com/ru/post/675886/"
		},
		{
			"title": "Модуль Net::Ethereum для работы с контрактами Solidity",
			"datetime": "2018-01-08T12:52:09.000Z",
			"author": "AlexandreFrolov",
			"description": "\n\r\nОбычно когда мне нужно использовать какой-то новый сервис или технологию из скриптов Perl, я захожу на CPAN, и там уже есть один или несколько подходящих модулей. Однако в случае фреймворков для работы с узлами блокчейна Ethereum и контрактами Solidity, к сожалению, мне не удалось найти нужного модуля. \n\r\nМы планируем в ближайшее время использовать смарт-контракты Solidity сети Ethereum в нашем SAAS-сервисе интернет-магазинов, написанном на Perl. Поэтому мне ничего не оставалось, как написать свой модуль Net::Ethereum (этот модуль уже доступен на CPAN, хотя и в виде альфа-версии).\n\r\nНадеюсь, что модуль Net::Ethereum будет полезен тем, кто хочет интегрировать свои Perl-системы с контрактами блокчейна Ethereum. Буду очень благодарен тем, кто воспользуется этим модулем и пришлет мне свои соображения по его доработке, а также информацию о найденных ошибках.",
			"tags": [
				"perl",
				"Solidity",
				"Ethereum",
				"geth",
				"DApp",
				"web3.js",
				"Rinkeby",
				"блокчейн",
				"криптовалюта",
				"смарт-контракт",
				"CPAN",
				"Net::Ethereum"
			],
			"link": "https://habr.com/ru/post/346234/"
		},
		{
			"title": "Это уже не «ранние дни»",
			"datetime": "2022-01-16T16:07:59.000Z",
			"author": "novusnota",
			"description": "Когда я говорю о неэффективности популярных блокчейнов; или упоминаю то, что мы, похоже, мчимся к web3, централизованному настолько, что это бросает вызов крепкой хватке больших технологических компаний современного веба; или указываю на то, что почему-то никому не удалось найти хороший способ применения блокчейна, который был бы лучше, чем альтернативные варианты его не использующие, я часто слышу: «Это ещё ранние дни», «Всё только начинается», «Дай ему шанс», «Люди всё ещё разбираются во всех этих блокчейн-технологиях, устраняя их недостатки»...",
			"tags": [
				"nft",
				"web3",
				"блокчейн",
				"blockchain",
				"криптовалюты",
				"криптовалюта",
				"ethereum",
				"обман пользователей",
				"оправдания",
				"обман людей"
			],
			"link": "https://habr.com/ru/post/645893/"
		},
		{
			"title": "Простые сайты снова в моде. Минимализм возвращается",
			"datetime": "2022-03-07T08:00:02.000Z",
			"author": "FirstJohn",
			"description": "\n\r\nСколько раз говорили об ожирении софта и сайтов, а воз и ныне там. Ситуация совершенно не улучшается. В 1993 году Word открывался за секунду, а сейчас за пять. Простейшие странички обвешаны десятками скриптов и грузятся бесконечно долго даже на многоядерной рабочей станции.\n\r\nТакая ситуация напрягает и самих веб-разработчиков. Приходится тратить кучу времени на оптимизацию, тестирование новомодных фич в разных браузерах, осваивать сложные CMS. Зачем? На самом деле HTML и CSS — исключительно мощные инструменты, если ими умело пользоваться.",
			"tags": [
				"FirstVDS",
				"FirstDEDIC",
				"HTML",
				"простые сайты",
				"web3",
				"web0",
				"задержка",
				"latency",
				"ожирение сайтов",
				"технологический стек",
				"Github",
				"ожирение софта",
				"прогресс",
				"минимализм"
			],
			"link": "https://habr.com/ru/post/653771/"
		},
		{
			"title": "Децентрализованное будущее. Каждому человеку — безопасная капсула для личных данных",
			"datetime": "2022-08-15T08:00:02.000Z",
			"author": "FirstJohn",
			"description": "\n\r\nВ 2009 году, когда самым продвинутым браузером в мире считалась Opera, разработчики выкатили уникальную функцию Opera Unite, что-то вроде интегрированного веб-сервера. Со своей маршрутизацией, схемой именования ресурсов и прокси — всё внутри экосистемы из одноранговой сети пользователей. Грубо говоря, каждый пользователь Opera становился хостером — и раздавал статические ресурсы.\n\r\nВ 2012 году проект Opera Unite закрыли. Ребята примерно на десять лет опередили время…",
			"tags": [
				"FirstVDS",
				"FirstDEDIC",
				"Schluss",
				"Solid",
				"Web3",
				"Web5",
				"DIDComm",
				"W3C",
				"DID",
				"DWN",
				"распределённые веб-приложения",
				"DWA",
				"Sidetree",
				"dWeb",
				"децентрализация"
			],
			"link": "https://habr.com/ru/post/681356/"
		},
		{
			"title": "web5 скорее всего будет, пока не расходимся",
			"datetime": "2022-06-30T18:31:05.000Z",
			"author": "flake",
			"description": "Узрев повторную статью-мнение-перевод на оригинальный пост фаундера Signal \"web3 не будет: расходимся по домам\" https://habr.com/ru/post/673836/, не смог устоять от соблазна дать расширенное op-ed опровержение. И в комментарий оно не влезло.Мое мнение, что Moxie сделал только эмоциональные выводы, хотя и назвал причину правильно: “Все упирается в нежелание людей держать свои сервера. Потому что держать сервера — это сложно, а мы хотим нажимать одну кнопку. “ а если покопаться более фундаментально, то все может предстать в более рациональных абстракциях.Рациональный анализ приземленный на уровни абстракций “имхо” таков:",
			"tags": [
				"decentralized identity",
				"NFT",
				"web1",
				"web2.0",
				"web3",
				"блокчейн",
				"bitcoin",
				"распределённые вычисления",
				"homomoprhic encryption",
				"formal verification"
			],
			"link": "https://habr.com/ru/post/674460/"
		},
		{
			"title": "Аутентификация в Django при помощи Metamask",
			"datetime": "2022-08-27T12:35:22.000Z",
			"author": "Sobolev5",
			"description": "Сегодня мы напишем простой сниппет для аутентификации пользователей на сайте при помощи кошелька Metamask. Замечу, что данное решение максимально изолировано от фреймворка. Вы сможете легко адаптировать его не только к Django, но и к Flask, Sanic, Starlette, Aiohttp и  т.п.",
			"tags": [
				"django",
				"metamask",
				"web3",
				"авторизация",
				"ethereum"
			],
			"link": "https://habr.com/ru/post/684958/"
		},
		{
			"title": "Неизвестные взломали сайт DeFi и украли $120 млн в криптовалюте",
			"datetime": "2021-12-04T07:39:30.000Z",
			"author": "maybe_elf",
			"description": "Неизвестные украли средства из нескольких криптовалютных кошельков, подключенных к децентрализованной финансовой платформе BadgerDAO. Сумма похищенного составляет около $120 млн.",
			"tags": [
				"defi",
				"децентрализованные сети",
				"биткоин",
				"криптовалюты",
				"криптовалютные кошельки",
				"кража",
				"web3",
				"вредоносный код"
			],
			"link": "https://habr.com/ru/post/593387/"
		},
		{
			"title": "Solana разработала криптотелефон при участии бывших инженеров Essential",
			"datetime": "2022-06-24T09:22:34.000Z",
			"author": "maybe_elf",
			"description": "Блокчейн-компания Solana анонсировала собственный мобильный телефон с криптографическими функциями под названием Saga, созданный в сотрудничестве с Osom. Это бывшая команда инженеров и дизайнеров из Essential, которые ранее разрабатывали устройство Osom OV1. ",
			"tags": [
				"solana",
				"osom",
				"смартфон",
				"децентрализованные приложения",
				"криптовалюты",
				"web3",
				"nft",
				"криптография",
				"конфиденциальность",
				"dapp"
			],
			"link": "https://habr.com/ru/post/673230/"
		},
		{
			"title": "Модели токеномик с одним или двумя токенами в криптоиграх",
			"datetime": "2022-06-15T15:28:20.000Z",
			"author": "mrkeksz",
			"description": "Использовать модель с одним или двумя токенами — один из самых частых вопросов, которые мне задают команды, разрабатывающие экономику своей криптоигры.До недавнего времени моим ответом по умолчанию всегда было использование двух токенов, но теперь я переосмыслил этот совет. Я думаю, что вы можете убедительно обосновать любой выбор, и я попытаюсь объяснить некоторые из этих нюансов здесь. Также может быть способ получить лучшее из обеих моделей, к чему я прихожу в конце.Эта статья в первую очередь будет посвящена играм, хотя вы можете применить аналогичные мысли и к другим криптопроектам. Игры — это хорошая песочница, в которой можно испытать это, поскольку они позволяют использовать гораздо больше токенов, чем другие проекты.В любом случае, давайте погрузимся.",
			"tags": [
				"криптовалюта",
				"децентрализация",
				"токеномика",
				"игры",
				"playtoearn",
				"p2e",
				"defi",
				"web3",
				"криптовалюты"
			],
			"link": "https://habr.com/ru/post/671566/"
		},
		{
			"title": "Генеральный директор компании Xsolla ушел с поста",
			"datetime": "2022-02-02T20:46:40.000Z",
			"author": "IgnatChuker",
			"description": "Александр Агапитов, также известный как Shurick Agapitov, покидает пост генерального директора Xsolla, о чем сообщает портал Venturebeat. Вместо него был назначен технический директор Константин Голубицкий. Но председателем совета директоров все равно остается Агапитов.",
			"tags": [
				"xsolla",
				"web3.0",
				"Agapitov",
				"Александр Агапитов",
				"генеральный директор",
				"Константин Голубицкий"
			],
			"link": "https://habr.com/ru/post/649405/"
		},
		{
			"title": "Обзор грантовых программ для блокчейн-разработчиков",
			"datetime": "2019-07-16T14:35:33.000Z",
			"author": "cigulev",
			"description": "Грантовые программы для блокчейн-разработчиков — довольно распространенная практика. Суть их в общем случае сводится к одному — денежное поощрение активных членов сообщества за участие в развитии экосистемы проекта (в данном случае речь в первую очередь идет о блокчейн-платформах для создания децентрализованных онлайн-сервисов, таких как Waves или Ethereum).\n\r\nПод «развитием экосистемы» может подразумеваться выявление и решение проблем, существующих на платформе, разработка недостающих сервисов и инструментов, создание образовательных материалов, интеграция продуктов платформы в реальный бизнес или что-то другое. \n\r\nПринцип работы грантовых программ на разных платформах не имеет существенных отличий. Блокчейн-компания определяет наиболее приоритетные для себя направления и выделяет бюджет на выплату грантов, как правило, в собственной криптовалюте.",
			"tags": [
				"блокчейн",
				"web3.0",
				"гранты",
				"разработка",
				"dapp",
				"waves platform",
				"программирование"
			],
			"link": "https://habr.com/ru/post/458422/"
		}
	]
}